# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for pandas 1.4.3

In [1]:
import numpy as np
import pandas as pd

# Object creation

In [2]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [3]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [4]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [5]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19 -0.284700  0.263672  1.727155 -0.416913
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-23  2.324467  0.964638 -1.090401  0.054523
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-28  2.598927  0.069795 -0.908757 -1.487151

In [6]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [7]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [8]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19 -0.284700  0.263672  1.727155 -0.416913
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-23  2.324467  0.964638 -1.090401  0.054523

In [9]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-28  2.598927  0.069795 -0.908757 -1.487151

In [10]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[-0.28470013,  0.26367161,  1.72715459, -0.41691291],
       [ 0.46721689, -1.47760435,  0.97192726,  0.4243311 ],
       [-1.15814007, -0.47738617,  0.87521737, -0.61144143],
       [-0.02855994,  0.31433697,  1.15359856,  0.61853992],
       [ 2.32446702,  0.96463807, -1.09040068,  0.05452283],
       [-2.00817208, -0.08369884,  1.69579224, -0.02705984],
       [-1.51349235,  0.43705506, -0.23734795, -0.78310669],
       [ 0.93287107,  1.33284576, -1.35661642, -0.67917526],
       [ 1.57249006, -0.78637709,  0.69486127, -0.35793432],
       [ 2.59892692,  0.06979539, -0.90875656, -1.48715132]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [14]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.290291   0.055728   0.352543  -0.326539
std     1.585445   0.821704   1.157187   0.620217
min    -2.008172  -1.477604  -1.356616  -1.487151
25%    -0.939780  -0.378964  -0.740904  -0.662242
50%     0.219328   0.166734   0.785039  -0.387424
75%     1.412585   0.406376   1.108181   0.034127
max     2.598927   1.332846   1.727155   0.618540

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [15]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.290291   0.055728   0.352543  -0.326539
std     1.585445   0.821704   1.157187   0.620217
min    -2.008172  -1.477604  -1.356616  -1.487151
10%    -1.562960  -0.855500  -1.117022  -0.853511
50%     0.219328   0.166734   0.785039  -0.387424
90%     2.351913   1.001459   1.698928   0.443752
max     2.598927   1.332846   1.727155   0.618540

In [16]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A    C    D
count  6.0  6.0  6.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [17]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,-0.284700,0.467217,-1.158140,-0.028560,2.324467,-2.008172,-1.513492,0.932871,1.572490,2.598927
B,0.263672,-1.477604,-0.477386,0.314337,0.964638,-0.083699,0.437055,1.332846,-0.786377,0.069795
C,1.727155,0.971927,0.875217,1.153599,-1.090401,1.695792,-0.237348,-1.356616,0.694861,-0.908757
D,-0.416913,0.424331,-0.611441,0.618540,0.054523,-0.027060,-0.783107,-0.679175,-0.357934,-1.487151

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [18]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19 -0.416913  1.727155  0.263672 -0.284700
2022-06-20  0.424331  0.971927 -1.477604  0.467217
2022-06-21 -0.611441  0.875217 -0.477386 -1.158140
2022-06-22  0.618540  1.153599  0.314337 -0.028560
2022-06-23  0.054523 -1.090401  0.964638  2.324467
2022-06-24 -0.027060  1.695792 -0.083699 -2.008172
2022-06-25 -0.783107 -0.237348  0.437055 -1.513492
2022-06-26 -0.679175 -1.356616  1.332846  0.932871
2022-06-27 -0.357934  0.694861 -0.786377  1.572490
2022-06-28 -1.487151 -0.908757  0.069795  2.598927

In [19]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28  2.598927  0.069795 -0.908757 -1.487151
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060
2022-06-23  2.324467  0.964638 -1.090401  0.054523
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-19 -0.284700  0.263672  1.727155 -0.416913

In [20]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-19 -0.284700  0.263672  1.727155 -0.416913
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-23  2.324467  0.964638 -1.090401  0.054523
2022-06-28  2.598927  0.069795 -0.908757 -1.487151

In [21]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [22]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [23]:
# selecting a single column returns a Series object
df["A"]

2022-06-19   -0.284700
2022-06-20    0.467217
2022-06-21   -1.158140
2022-06-22   -0.028560
2022-06-23    2.324467
2022-06-24   -2.008172
2022-06-25   -1.513492
2022-06-26    0.932871
2022-06-27    1.572490
2022-06-28    2.598927
Freq: D, Name: A, dtype: float64

In [24]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-23  2.324467  0.964638 -1.090401  0.054523

## Selection by label

In [25]:
# selecting based on a label
df.loc[dates[0]]

A   -0.284700
B    0.263672
C    1.727155
D   -0.416913
Name: 2022-06-19 00:00:00, dtype: float64

In [26]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19 -0.284700  0.263672
2022-06-20  0.467217 -1.477604
2022-06-21 -1.158140 -0.477386
2022-06-22 -0.028560  0.314337
2022-06-23  2.324467  0.964638
2022-06-24 -2.008172 -0.083699
2022-06-25 -1.513492  0.437055
2022-06-26  0.932871  1.332846
2022-06-27  1.572490 -0.786377
2022-06-28  2.598927  0.069795

In [27]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A    0.467217
B   -1.477604
C    0.971927
D    0.424331
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [28]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

-0.28470013437508274

In [29]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

-0.28470013437508274

## Selection by position

In [30]:
df.iloc[2]

A   -1.158140
B   -0.477386
C    0.875217
D   -0.611441
Name: 2022-06-21 00:00:00, dtype: float64

In [31]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20  0.467217 -1.477604
2022-06-21 -1.158140 -0.477386
2022-06-22 -0.028560  0.314337
2022-06-23  2.324467  0.964638

In [32]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19 -0.284700  1.727155
2022-06-20  0.467217  0.971927
2022-06-21 -1.158140  0.875217
2022-06-25 -1.513492 -0.237348

In [33]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19  1.727155  0.263672 -0.284700  1.727155
2022-06-20  0.971927 -1.477604  0.467217  0.971927
2022-06-21  0.875217 -0.477386 -1.158140  0.875217
2022-06-25 -0.237348  0.437055 -1.513492 -0.237348

In [34]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441

In [35]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19  1.727155 -0.416913
2022-06-20  0.971927  0.424331
2022-06-21  0.875217 -0.611441
2022-06-22  1.153599  0.618540
2022-06-23 -1.090401  0.054523
2022-06-24  1.695792 -0.027060
2022-06-25 -0.237348 -0.783107
2022-06-26 -1.356616 -0.679175
2022-06-27  0.694861 -0.357934
2022-06-28 -0.908757 -1.487151

In [36]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19 -0.284700  0.263672  1.727155 -0.416913
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441
2022-06-22 -0.028560  0.314337  1.153599  0.618540
2022-06-23  2.324467  0.964638 -1.090401  0.054523
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-28  2.598927  0.069795 -0.908757 -1.487151

In [37]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

0.971927260473299

In [38]:
#
# method two: use iat
df.iat[1, 2]

0.971927260473299

## Boolean Indexing

In [39]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-20  0.467217 -1.477604  0.971927  0.424331
2022-06-23  2.324467  0.964638 -1.090401  0.054523
2022-06-26  0.932871  1.332846 -1.356616 -0.679175
2022-06-27  1.572490 -0.786377  0.694861 -0.357934
2022-06-28  2.598927  0.069795 -0.908757 -1.487151

In [40]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19       NaN  0.263672  1.727155       NaN
2022-06-20  0.467217       NaN  0.971927  0.424331
2022-06-21       NaN       NaN  0.875217       NaN
2022-06-22       NaN  0.314337  1.153599  0.618540
2022-06-23  2.324467  0.964638       NaN  0.054523
2022-06-24       NaN       NaN  1.695792       NaN
2022-06-25       NaN  0.437055       NaN       NaN
2022-06-26  0.932871  1.332846       NaN       NaN
2022-06-27  1.572490       NaN  0.694861       NaN
2022-06-28  2.598927  0.069795       NaN       NaN

In [41]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19 -0.284700  0.263672  1.727155 -0.416913    one
2022-06-20  0.467217 -1.477604  0.971927  0.424331    two
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  three
2022-06-22 -0.028560  0.314337  1.153599  0.618540   four
2022-06-23  2.324467  0.964638 -1.090401  0.054523    two
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060   five
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107    one
2022-06-26  0.932871  1.332846 -1.356616 -0.679175    two
2022-06-27  1.572490 -0.786377  0.694861 -0.357934  three
2022-06-28  2.598927  0.069795 -0.908757 -1.487151   four

In [42]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20  0.467217 -1.477604  0.971927  0.424331   two
2022-06-23  2.324467  0.964638 -1.090401  0.054523   two
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060  five
2022-06-26  0.932871  1.332846 -1.356616 -0.679175   two

## Setting values

In [43]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [44]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19 -0.284700  0.263672  1.727155 -0.416913  11
2022-06-20  0.467217 -1.477604  0.971927  0.424331  12
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  13
2022-06-22 -0.028560  0.314337  1.153599  0.618540  14
2022-06-23  2.324467  0.964638 -1.090401  0.054523  15
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060  16
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107  17
2022-06-26  0.932871  1.332846 -1.356616 -0.679175  18
2022-06-27  1.572490 -0.786377  0.694861 -0.357934  19
2022-06-28  2.598927  0.069795 -0.908757 -1.487151  20

In [45]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19 -0.284700  0.263672  1.727155 -0.416913  11
2022-06-20  0.467217 -1.477604  0.971927  0.424331  12
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  13
2022-06-22 -0.028560  0.314337  1.153599  0.618540  14
2022-06-23  2.324467  0.964638 -1.090401  0.054523  15
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060  16
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107  17
2022-06-26  0.932871  1.332846 -1.356616 -0.679175  18
2022-06-27  1.572490 -0.786377  0.694861 -0.357934  19
2022-06-28  2.598927  0.069795 -0.908757 -1.487151  20

In [46]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000  1.727155 -0.416913  11
2022-06-20  0.467217 -1.477604  0.971927  0.424331  12
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  13
2022-06-22 -0.028560  0.314337  1.153599  0.618540  14
2022-06-23  2.324467  0.964638 -1.090401  0.054523  15
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060  16
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107  17
2022-06-26  0.932871  1.332846 -1.356616 -0.679175  18
2022-06-27  1.572490 -0.786377  0.694861 -0.357934  19
2022-06-28  2.598927  0.069795 -0.908757 -1.487151  20

In [47]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000  1.727155  5  11
2022-06-20  0.467217 -1.477604  0.971927  5  12
2022-06-21 -1.158140 -0.477386  0.875217  5  13
2022-06-22 -0.028560  0.314337  1.153599  5  14
2022-06-23  2.324467  0.964638 -1.090401  5  15
2022-06-24 -2.008172 -0.083699  1.695792  5  16
2022-06-25 -1.513492  0.437055 -0.237348  5  17
2022-06-26  0.932871  1.332846 -1.356616  5  18
2022-06-27  1.572490 -0.786377  0.694861  5  19
2022-06-28  2.598927  0.069795 -0.908757  5  20

In [48]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -1.727155 -5 -11
2022-06-20 -0.467217 -1.477604 -0.971927 -5 -12
2022-06-21 -1.158140 -0.477386 -0.875217 -5 -13
2022-06-22 -0.028560 -0.314337 -1.153599 -5 -14
2022-06-23 -2.324467 -0.964638 -1.090401 -5 -15
2022-06-24 -2.008172 -0.083699 -1.695792 -5 -16
2022-06-25 -1.513492 -0.437055 -0.237348 -5 -17
2022-06-26 -0.932871 -1.332846 -1.356616 -5 -18
2022-06-27 -1.572490 -0.786377 -0.694861 -5 -19
2022-06-28 -2.598927 -0.069795 -0.908757 -5 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [49]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19 -0.284700  0.263672  1.727155 -0.416913  11 NaN
2022-06-20  0.467217 -1.477604  0.971927  0.424331  12 NaN
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  13 NaN
2022-06-22 -0.028560  0.314337  1.153599  0.618540  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [50]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                  A         B         C         D   F    G
2022-06-19 -0.28470  0.263672  1.727155 -0.416913  11  NaN
2022-06-20      NaN -1.477604  0.971927  0.424331  12  0.0
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [51]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [52]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [53]:
# the original is still there
df13

                  A         B         C         D   F    G
2022-06-19 -0.28470  0.263672  1.727155 -0.416913  11  NaN
2022-06-20      NaN -1.477604  0.971927  0.424331  12  0.0
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [54]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                  A         B         C         D   F    G
2022-06-19 -0.28470  0.263672  1.727155 -0.416913  11  NaN
2022-06-20      NaN -1.477604  0.971927  0.424331  12  0.0
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [55]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [56]:
# all rows/cols with missing data stripped
df_no_na

                  A         B         C         D   F    G
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [57]:
# original still intact
df132

                  A         B         C         D   F    G
2022-06-19 -0.28470  0.263672  1.727155 -0.416913  11  NaN
2022-06-20      NaN -1.477604  0.971927  0.424331  12  0.0
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [58]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                  A         B         C         D   F    G
2022-06-21 -1.15814 -0.477386  0.875217 -0.611441  13  0.0
2022-06-22 -0.02856  0.314337  1.153599  0.618540  14  0.0

In [59]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19    -0.284700  0.263672  1.727155 -0.416913  11  3141.592654
2022-06-20  3141.592654 -1.477604  0.971927  0.424331  12     0.000000
2022-06-21    -1.158140 -0.477386  0.875217 -0.611441  13     0.000000
2022-06-22    -0.028560  0.314337  1.153599  0.618540  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [60]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [61]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [62]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
def render_df_side_by_side(a, b, a_title = "", b_title = ""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(a_title)
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(b_title)
    display_html(a_styler._repr_html_()+b_styler._repr_html_(), raw=True)

In [63]:
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.692325,5
2022-01-02 00:00:00,0.244641,24
2022-01-03 00:00:00,0.356281,12
2022-01-04 00:00:00,0.724742,3
2022-01-05 00:00:00,0.413745,2
2022-01-06 00:00:00,0.202746,15
2022-01-07 00:00:00,0.307664,15
2022-01-08 00:00:00,0.129280,8
2022-01-09 00:00:00,0.934851,1
2022-01-10 00:00:00,0.530138,17
,A,B
2022-01-03 00:00:00,0.268556,14
2022-01-04 00:00:00,0.018898,2
2022-01-05 00:00:00,0.900943,19
2022-01-06 00:00:00,0.117141,17
2022-01-07 00:00:00,0.072872,9
2022-01-08 00:00:00,0.713322,23
2022-01-09 00:00:00,0.984275,23
2022-01-10 00:00:00,0.047950,16
2022-01-11 00:00:00,0.996361,1
2022-01-12 00:00:00,0.760520,6

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [64]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1+d2
d4 = d1.sub(d2) #equivalent to d1-d2
d5 = d1*d2
d6 = d1.div(d2)

In [65]:
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

In [66]:
# sub
d4.style.highlight_null(null_color='red')

In [67]:
# mul
d5.style.highlight_null(null_color='red')

In [68]:
# div
d6.style.highlight_null(null_color='red')

### removing the NaN values from the resultant dataframe

In [69]:
# the + operation is UNION of indexes
d31 = d1+d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(null_color='red')

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [70]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join='outer')
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.692325,5.000000
2022-01-02 00:00:00,0.244641,24.000000
2022-01-03 00:00:00,0.356281,12.000000
2022-01-04 00:00:00,0.724742,3.000000
2022-01-05 00:00:00,0.413745,2.000000
2022-01-06 00:00:00,0.202746,15.000000
2022-01-07 00:00:00,0.307664,15.000000
2022-01-08 00:00:00,0.129280,8.000000
2022-01-09 00:00:00,0.934851,1.000000
2022-01-10 00:00:00,0.530138,17.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.268556,14.000000
2022-01-04 00:00:00,0.018898,2.000000
2022-01-05 00:00:00,0.900943,19.000000
2022-01-06 00:00:00,0.117141,17.000000
2022-01-07 00:00:00,0.072872,9.000000
2022-01-08 00:00:00,0.713322,23.000000
2022-01-09 00:00:00,0.984275,23.000000
2022-01-10 00:00:00,0.047950,16.000000
2022-01-11 00:00:00,0.996361,1.000000
2022-01-12 00:00:00,0.760520,6.000000

In [71]:
# inner join
left, right = d1.align(d2, join='inner')
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.692325,5
2022-01-02 00:00:00,0.244641,24
2022-01-03 00:00:00,0.356281,12
2022-01-04 00:00:00,0.724742,3
2022-01-05 00:00:00,0.413745,2
2022-01-06 00:00:00,0.202746,15
2022-01-07 00:00:00,0.307664,15
2022-01-08 00:00:00,0.129280,8
2022-01-09 00:00:00,0.934851,1
2022-01-10 00:00:00,0.530138,17
,A,B
2022-01-03 00:00:00,0.268556,14
2022-01-04 00:00:00,0.018898,2
2022-01-05 00:00:00,0.900943,19
2022-01-06 00:00:00,0.117141,17
2022-01-07 00:00:00,0.072872,9
2022-01-08 00:00:00,0.713322,23
2022-01-09 00:00:00,0.984275,23
2022-01-10 00:00:00,0.047950,16
2022-01-11 00:00:00,0.996361,1
2022-01-12 00:00:00,0.760520,6

In [72]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join='outer', fill_value = -100) 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.692325,5
2022-01-02 00:00:00,0.244641,24
2022-01-03 00:00:00,0.356281,12
2022-01-04 00:00:00,0.724742,3
2022-01-05 00:00:00,0.413745,2
2022-01-06 00:00:00,0.202746,15
2022-01-07 00:00:00,0.307664,15
2022-01-08 00:00:00,0.129280,8
2022-01-09 00:00:00,0.934851,1
2022-01-10 00:00:00,0.530138,17
2022-01-11 00:00:00,-100.000000,-100
2022-01-12 00:00:00,-100.000000,-100
,A,B
2022-01-01 00:00:00,-100.000000,-100
2022-01-02 00:00:00,-100.000000,-100
2022-01-03 00:00:00,0.268556,14
2022-01-04 00:00:00,0.018898,2
2022-01-05 00:00:00,0.900943,19
2022-01-06 00:00:00,0.117141,17
2022-01-07 00:00:00,0.072872,9
2022-01-08 00:00:00,0.713322,23
2022-01-09 00:00:00,0.984275,23
2022-01-10 00:00:00,0.047950,16
2022-01-11 00:00:00,0.996361,1
2022-01-12 00:00:00,0.760520,6

In [73]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join='left') 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.692325,5
2022-01-02 00:00:00,0.244641,24
2022-01-03 00:00:00,0.356281,12
2022-01-04 00:00:00,0.724742,3
2022-01-05 00:00:00,0.413745,2
2022-01-06 00:00:00,0.202746,15
2022-01-07 00:00:00,0.307664,15
2022-01-08 00:00:00,0.129280,8
2022-01-09 00:00:00,0.934851,1
2022-01-10 00:00:00,0.530138,17
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.268556,14.000000
2022-01-04 00:00:00,0.018898,2.000000
2022-01-05 00:00:00,0.900943,19.000000
2022-01-06 00:00:00,0.117141,17.000000
2022-01-07 00:00:00,0.072872,9.000000
2022-01-08 00:00:00,0.713322,23.000000
2022-01-09 00:00:00,0.984275,23.000000
2022-01-10 00:00:00,0.047950,16.000000

In [74]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join='right') 
render_df_side_by_side(left, right)

,A,B
2022-01-03 00:00:00,0.356281,12.000000
2022-01-04 00:00:00,0.724742,3.000000
2022-01-05 00:00:00,0.413745,2.000000
2022-01-06 00:00:00,0.202746,15.000000
2022-01-07 00:00:00,0.307664,15.000000
2022-01-08 00:00:00,0.129280,8.000000
2022-01-09 00:00:00,0.934851,1.000000
2022-01-10 00:00:00,0.530138,17.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-03 00:00:00,0.268556,14
2022-01-04 00:00:00,0.018898,2
2022-01-05 00:00:00,0.900943,19
2022-01-06 00:00:00,0.117141,17
2022-01-07 00:00:00,0.072872,9
2022-01-08 00:00:00,0.713322,23
2022-01-09 00:00:00,0.984275,23
2022-01-10 00:00:00,0.047950,16
2022-01-11 00:00:00,0.996361,1
2022-01-12 00:00:00,0.760520,6

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [75]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A     0.290291
B     0.055728
C     0.352543
D    -0.326539
F    15.500000
dtype: float64

In [76]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    2.457843
2022-06-20    2.477174
2022-06-21    2.325650
2022-06-22    3.211583
2022-06-23    3.450645
2022-06-24    3.115372
2022-06-25    2.980622
2022-06-26    3.645985
2022-06-27    4.024608
2022-06-28    4.054563
Freq: D, dtype: float64

## Apply

In [77]:
# apply custom lambdas
df.apply(lambda x: x.max()-x.min())

A    4.607099
B    2.810450
C    3.083771
D    2.105691
F    9.000000
dtype: float64

In [78]:
df

                   A         B         C         D   F
2022-06-19 -0.284700  0.263672  1.727155 -0.416913  11
2022-06-20  0.467217 -1.477604  0.971927  0.424331  12
2022-06-21 -1.158140 -0.477386  0.875217 -0.611441  13
2022-06-22 -0.028560  0.314337  1.153599  0.618540  14
2022-06-23  2.324467  0.964638 -1.090401  0.054523  15
2022-06-24 -2.008172 -0.083699  1.695792 -0.027060  16
2022-06-25 -1.513492  0.437055 -0.237348 -0.783107  17
2022-06-26  0.932871  1.332846 -1.356616 -0.679175  18
2022-06-27  1.572490 -0.786377  0.694861 -0.357934  19
2022-06-28  2.598927  0.069795 -0.908757 -1.487151  20

In [79]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

,A,B,C,D,F
2022-06-19 00:00:00,-0.284700,0.263672,1.727155,-0.416913,11
2022-06-20 00:00:00,0.467217,-1.477604,0.971927,0.424331,12
2022-06-21 00:00:00,-1.158140,-0.477386,0.875217,-0.611441,13
2022-06-22 00:00:00,-0.028560,0.314337,1.153599,0.618540,14
2022-06-23 00:00:00,2.324467,0.964638,-1.090401,0.054523,15
2022-06-24 00:00:00,-2.008172,-0.083699,1.695792,-0.027060,16
2022-06-25 00:00:00,-1.513492,0.437055,-0.237348,-0.783107,17
2022-06-26 00:00:00,0.932871,1.332846,-1.356616,-0.679175,18
2022-06-27 00:00:00,1.572490,-0.786377,0.694861,-0.357934,19
2022-06-28 00:00:00,2.598927,0.069795,-0.908757,-1.487151,20
,A,B,C,D,F
2022-06-19 00:00:00,-0.284700,0.263672,1.727155,-0.416913,11
2022-06-20 00:00:00,0.182517,-1.213933,2.699082,0.007418,23
2022-06-21 00:00:00,-0.975623,-1.691319,3.574299,-0.604023,36
2022-06-22 00:00:00,-1.004183,-1.376982,4.727898,0.014517,50
2022-06-23 00:00:00,1.320284,-0.412344,3.637497,0.069040,65
2022-06-24 00:00:00,-0.687888,-0.496043,5.333289,0.041980,81
2022-06-25 00:00:00,-2.201381,-0.058988,5.095941,-0.741127,98
2022-06-26 00:00:00,-1.268510,1.273858,3.739325,-1.420302,116
2022-06-27 00:00:00,0.303980,0.487481,4.434186,-1.778237,135
2022-06-28 00:00:00,2.902907,0.557276,3.525430,-3.265388,155

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [80]:
series1 = pd.Series(np.random.randint(0,5, size = 25))
series1.value_counts()

0    8
2    6
1    4
3    4
4    3
dtype: int64

## String Methods

In [81]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split()) # split splits on whitespace by default

In [82]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        'og': str_series,
        'length': str_series.str.len(),
        'low': low,
        'up': up,
        'split_low_on_i': low.str.split('i', expand = False), # expand = True will break this usecase, try elsewhere
        'replace_a_with_star_in_low': low.str.replace('a','*', case=False, regex=True) # yeah, you can mess with regular expns
    })

low_up_df.tail(10)

,og,length,low,up,split_low_on_i,replace_a_with_star_in_low
36,eXpreSsiONs,11,expressions,EXPRESSIONS,"[express, ons]",expressions
37,bY,2,by,BY,[by],by
38,DEfault,7,default,DEFAULT,[default],def*ult
39,(aND,4,(and,(AND,[(and],(*nd
40,In,2,in,IN,"[, n]",in
41,Some,4,some,SOME,[some],some
42,cases,5,cases,CASES,[cases],c*ses
43,AlwayS,6,always,ALWAYS,[always],*lw*ys
44,uSEs,4,uses,USES,[uses],uses
45,tHeM).,6,them).,THEM).,[them).],them).

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [83]:
# let's make some more dataframes
concatDF = pd.DataFrame(np.random.randn(10,4)) # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display('broken DFs: ',pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

'broken DFs: '

[          0         1         2         3
 0  0.750799 -1.243840 -0.396437 -0.696112
 1 -0.447740 -0.411056  1.031169  0.771287
 2  2.195605  1.103496 -0.593146  0.777431,
           0         1         2         3
 3 -0.494048  1.020021 -0.004973  0.345401
 4  0.756710 -1.195965  1.161042  0.064063
 5 -0.668811  0.554420 -0.081689 -1.398722
 6 -0.693520  0.625029 -0.247402 -0.667691,
           0         1         2         3
 7 -0.114132  0.128161  0.824995  0.280219
 8 -1.219803 -0.837240  1.235085 -2.557425
 9 -0.444746  0.103667 -1.415629 -1.093310]

,0,1,2,3
0,0.750799,-1.243840,-0.396437,-0.696112
1,-0.447740,-0.411056,1.031169,0.771287
2,2.195605,1.103496,-0.593146,0.777431
3,-0.494048,1.020021,-0.004973,0.345401
4,0.756710,-1.195965,1.161042,0.064063
5,-0.668811,0.554420,-0.081689,-1.398722
6,-0.693520,0.625029,-0.247402,-0.667691
7,-0.114132,0.128161,0.824995,0.280219
8,-1.219803,-0.837240,1.235085,-2.557425
9,-0.444746,0.103667,-1.415629,-1.093310
,0,1,2,3
0,0.750799,-1.243840,-0.396437,-0.696112
1,-0.447740,-0.411056,1.031169,0.771287
2,2.195605,1.103496,-0.593146,0.777431
3,-0.494048,1.020021,-0.004973,0.345401
4,0.756710,-1.195965,1.161042,0.064063
5,-0.668811,0.554420,-0.081689,-1.398722
6,-0.693520,0.625029,-0.247402,-0.667691
7,-0.114132,0.128161,0.824995,0.280219
8,-1.219803,-0.837240,1.235085,-2.557425
9,-0.444746,0.103667,-1.415629,-1.093310

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [104]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame(
    {
        'key': list('ABCDEF'),
        'lval': sl
    }
)

right = pd.DataFrame(
    {
        'key': list('ABBCDE'),
        'rval': sr
    }
)

In [105]:
render_df_side_by_side(left, right, 'left', 'right')

,key,lval
0,A,0
1,B,6
2,C,2
3,D,8
4,E,6
5,F,3
,key,rval
0,A,0
1,B,0
2,B,0
3,C,6
4,D,2
5,E,8

In [106]:
result = pd.merge(left, right, on='key')
result

  key  lval  rval
0   A     0     0
1   B     6     0
2   B     6     0
3   C     2     6
4   D     8     2
5   E     6     8

# Grouping